app/controllers/bdatabases_controller.rb

SELECT "bdatabases".* FROM "bdatabases"
---
  def index
    @bdatabases = Bdatabase.all

SELECT "bdatabases".* FROM "bdatabases" WHERE "bdatabases"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @bdatabase = Bdatabase.find(params[:id])

INSERT INTO "bdatabases" ("created_at", "msg", "mtype", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 06 Jul 2012 10:28:07 UTC +00:00], ["msg", "you are very dumb and stupid dummy"], ["mtype", "bullying"], ["updated_at", Fri, 06 Jul 2012 10:28:07 UTC +00:00]]
---
  def create
    @bdatabase = Bdatabase.new(params[:bdatabase])

    respond_to do |format|
      if @bdatabase.save

SELECT "bdatabases".* FROM "bdatabases" WHERE "bdatabases"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "bdatabases" WHERE "bdatabases"."id" = ?  [["id", 7]]
---
  def destroy
    @bdatabase = Bdatabase.find(params[:id])
    @bdatabase.destroy