app/controllers/msgs_controller.rb

SELECT "msgs".* FROM "msgs"
---
  def index
    @msgs = Msg.all

SELECT "msgs".* FROM "msgs" WHERE "msgs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @msg = Msg.find(params[:id])

INSERT INTO "msgs" ("created_at", "msg", "type", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 06 Jul 2012 10:22:48 UTC +00:00], ["msg", "you are very dumb and stupid dummy"], ["type", "bullying"], ["updated_at", Fri, 06 Jul 2012 10:22:48 UTC +00:00]]
---
  def create
    @msg = Msg.new(params[:msg])

    respond_to do |format|
      if @msg.save