app/controllers/signups_controller.rb

  def create
  	@signup = Signup.new(params[:signup])
  	@signup.save
---
INSERT INTO "signups" ("birthday", "created_at", "email", "email2", "first_name", "last_name", "password", "retype_email", "retype_password", "sex", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)