app/controllers/signins_controller.rb

  def create
    @signin = Signin.new(params[:signin])
  	@signin.save
---
INSERT INTO "signins" ("created_at", "password", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Mon, 02 Jul 2012 21:03:34 UTC +00:00], ["password", nil], ["updated_at", Mon, 02 Jul 2012 21:03:34 UTC +00:00], ["username", nil]]